# Practice: Basic SQL

## Task 0: Delete the INSTRUCTOR table

``` DROP TABLE INSTRUCTOR;```

## Task 1: Create the table INSTRUCTOR

- Primary key: ins_id 
- Columns: lastname and firstname not null, city and country.

```
CREATE TABLE INSTRUCTOR (
	ins_id INTEGER PRIMARY KEY NOT NULL, 
	lastname VARCHAR(24) NOT NULL,
	firstname VARCHAR(24) NOT NULL,
	city VARCHAR(24),
	country CHAR(2)
);

```

## Task2a: Insert a row in the INSTRUCTOR table for the instructor Rav Ahuja

Inserta una fila en la tabla INSTRUCTOR para el instructor Rav Ahuja.

```
INSERT INTO INSTRUCTOR (ins_id, lastname, firstname, city, country) VALUES (1, 'Ahuja', 'Rav', 'Toronto', 'CA');

```

## Task2b: Insert two rows in at the same time 

```
INSERT INTO INSTRUCTOR (ins_id, lastname, firstname, city, country) 
VALUES (2, 'Chong', 'Raul', 'Toronto', 'CA'), 
(3, 'Vasudevan', 'Hima', 'Chicago', 'US');
```

## Task 3a: Select all the rows of the instructor table 

```
SELECT * from INSTRUCTOR;
```

## Task 3b: Select firstname, lastname, country or instructor table where city equals Toronto

```
SELECT firstname, lastname, country
FROM instructor
WHERE city='Toronto';
```

## Task 4: Update the Rav Ahuja row changing the city by 'Markham'.

```
UPDATE INSTRUCTOR SET city='Markahm' WHERE ins_id=1;

```

## Task 5a: Delete the Raul Chong row

```
DELETE FROM INSTRUCTOR WHERE ins_id=2;
```

## Tarea 5b: get all the rows of instructor table

```
select * from INSTRUCTOR;
```